STMicroelectronics/STM32CubeWL/Projects/NUCLEO-WL55JC/Applications/SBSFU_2_Images_DualCore/2_Images_SBSFU/CM0PLUS/SBSFU/Target/sfu_low_level_security.c
/**
  ******************************************************************************
  * @file    sfu_low_level_security.c
  * @author  MCD Application Team
  * @brief   SFU Security Low Level Interface module
  *          This file provides set of firmware functions to manage SFU security
  *          low level interface.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "sfu_low_level_security.h"
#include "sfu_low_level_flash_int.h"
#include "sfu_low_level.h"
#include "sfu_trace.h"
#include "sfu_boot.h"
#include "sfu_fsm_states.h" /* needed for sfu_error.h */
#include "sfu_error.h"
#include "stm32wlxx_it.h"
#include "sfu_mpu_isolation.h"        /* Secure Engine isolated thanks to MPU */

#ifndef  SFU_WRP_PROTECT_ENABLE
#warning "SFU_WRP_PROTECT_DISABLED"
#endif /* SFU_WRP_PROTECT_ENABLE */

#ifndef  SFU_RDP_PROTECT_ENABLE
#warning "SFU_RDP_PROTECT_DISABLED"
#endif /* SFU_RDP_PROTECT_ENABLE */


#ifndef  SFU_MPU_PROTECT_ENABLE
#warning "SFU_MPU_PROTECT_DISABLED"
#endif /* SFU_MPU_PROTECT_ENABLE */

#ifndef  SFU_GTZC_PROTECT_ENABLE
#warning "SFU_GTZC_PROTECT_DISABLED"
#endif /* SFU_GTZC_PROTECT_ENABLE */

#ifndef  SFU_C2_DDS_PROTECT_ENABLE
#warning "SFU_C2_DDS_PROTECT_DISABLED"
#endif /* SFU_C2_DDS_PROTECT_ENABLE */

#ifndef  SFU_C2SWDBG_PROTECT_ENABLE
#warning "SFU_C2SWDBG_DISABLED"
#endif /* SFU_C2SWDBG_PROTECT_ENABLE */


#ifndef  SFU_TAMPER_PROTECT_ENABLE
/* #warning "SFU_TAMPER_PROTECT_DISABLED" */
#endif /* SFU_TAMPER_PROTECT_ENABLE */

#ifndef  SFU_DAP_PROTECT_ENABLE
#warning "SFU_DAP_PROTECT_DISABLED"
#endif /* SFU_DAP_PROTECT_ENABLE */

#ifndef  SFU_DMA_PROTECT_ENABLE
#warning "SFU_DMA_PROTECT_DISABLED"
#endif /* SFU_DMA_PROTECT_ENABLE */

#ifndef  SFU_IWDG_PROTECT_ENABLE
#warning "SFU_IWDG_PROTECT_DISABLED"
#endif /* SFU_IWDG_PROTECT_ENABLE */

#ifndef  SFU_SECURE_USER_PROTECT_ENABLE
#warning "SFU_SECURE_USER_PROTECT_DISABLED"
#endif /* SFU_SECURE_USER_PROTECT_ENABLE */

/* Private typedef -----------------------------------------------------------*/
typedef enum
{
  SFU_FALSE = 0U,
  SFU_TRUE = !SFU_FALSE
} SFU_BoolTypeDef;

typedef struct
{
  uint8_t                Number;            /*!< Specifies the number of the region to protect. This parameter can be a
                                                 value of CORTEX_MPU_Region_Number */
  uint32_t               BaseAddress;       /*!< Specifies the base address of the region to protect. */
  uint8_t                Size;              /*!< Specifies the size of the region to protect. */
  uint8_t                AccessPermission;  /*!< Specifies the region access permission type. This parameter can be a
                                                 value of CORTEX_MPU_Region_Permission_Attributes */
  uint8_t                DisableExec;       /*!< Specifies the instruction access status. This parameter can be a value
                                                 of  CORTEX_MPU_Instruction_Access */
  uint8_t                SubRegionDisable;  /*!< Specifies the sub region field (region is divided in 8 slices) when bit
                                                 is 1 region sub region is disabled */
  uint8_t                Tex;               /*!< Specifies the tex value  */
  uint8_t                Cacheable;         /*!< Specifies the cacheable value  */
  uint8_t                Bufferable;        /*!< Specifies the cacheable value  */
} SFU_MPU_InitTypeDef;

typedef uint32_t      SFU_ProtectionTypeDef;  /*!<   SFU HAL IF Protection Type Def*/

/* Private variables ---------------------------------------------------------*/
#ifdef  SFU_IWDG_PROTECT_ENABLE
static IWDG_HandleTypeDef   IwdgHandle;

#endif /* SFU_IWDG_PROTECT_ENABLE */
#ifdef  SFU_MPU_PROTECT_ENABLE
static SFU_MPU_InitTypeDef MpuAreas[] =

{
  /* Aliases Region and all User Flash & internal RAM */
  {
    SFU_PROTECT_MPU_AREA_USER_RGNV, SFU_PROTECT_MPU_AREA_USER_START, SFU_PROTECT_MPU_AREA_USER_SIZE,
    SFU_PROTECT_MPU_AREA_USER_PERM, SFU_PROTECT_MPU_AREA_USER_EXECV, SFU_PROTECT_MPU_AREA_USER_SREG,
    SFU_PROTECT_MPU_AREA_USER_TEXV, SFU_PROTECT_MPU_AREA_USER_C,     SFU_PROTECT_MPU_AREA_USER_B
  },

  /* install header : read /write only for privileged */
  {
    SFU_PROTECT_MPU_HEADER_RGNV, SFU_PROTECT_MPU_HEADER_START, SFU_PROTECT_MPU_HEADER_SIZE,
    SFU_PROTECT_MPU_HEADER_PERM, SFU_PROTECT_MPU_HEADER_EXECV, SFU_PROTECT_MPU_HEADER_SREG,
    SFU_PROTECT_MPU_HEADER_TEXV, SFU_PROTECT_MPU_HEADER_C, SFU_PROTECT_MPU_HEADER_B
  },

  /*  Flash execution */
  {
    SFU_PROTECT_MPU_FLASHEXE_RGNV, SFU_PROTECT_MPU_FLASHEXE_START, SFU_PROTECT_MPU_FLASHEXE_SIZE,
    SFU_PROTECT_MPU_FLASHEXE_PERM, SFU_PROTECT_MPU_FLASHEXE_EXECV, SFU_PROTECT_MPU_FLASHEXE_SREG,
    SFU_PROTECT_MPU_FLASHEXE_TEXV, SFU_PROTECT_MPU_FLASHEXE_C, SFU_PROTECT_MPU_FLASHEXE_B
  },

  /* KMS_DataStorage: NVM storage */
  {
    SFU_PROTECT_MPU_KMS_RGNV, SFU_PROTECT_MPU_KMS_START, SFU_PROTECT_MPU_KMS_SIZE,
    SFU_PROTECT_MPU_KMS_PERM, SFU_PROTECT_MPU_KMS_EXECV, SFU_PROTECT_MPU_KMS_SREG,
    SFU_PROTECT_MPU_KMS_TEXV, SFU_PROTECT_MPU_KMS_C, SFU_PROTECT_MPU_KMS_B
  },
  /*  peripheral  */
  {
    SFU_PROTECT_MPU_PERIPH_1_RGNV, SFU_PROTECT_MPU_PERIPH_1_START, SFU_PROTECT_MPU_PERIPH_1_SIZE,
    SFU_PROTECT_MPU_PERIPH_1_PERM, SFU_PROTECT_MPU_PERIPH_1_EXECV, SFU_PROTECT_MPU_PERIPH_1_SREG,
    SFU_PROTECT_MPU_PERIPH_1_TEXV, SFU_PROTECT_MPU_PERIPH_1_C, SFU_PROTECT_MPU_PERIPH_1_B
  }
};
#endif /* SFU_MPU_PROTECT_ENABLE */

