STMicroelectronics/STM32CubeWL/Projects/NUCLEO-WL55JC/Applications/SBSFU_2_Images_DualCore/2_Images_SBSFU/CM0PLUS/SBSFU/Target/sfu_low_level_security.c
#ifdef SFU_WRP_PROTECT_ENABLE
/**
  * @brief  Check the WRP protection to the specified Area. It includes the SFU Vector Table
  * @param  psFlashOptionBytes: pointer to the Option Bytes structure
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_CheckProtectionWRP(FLASH_OBProgramInitTypeDef *psFlashOptionBytes)
{
  SFU_ErrorStatus e_ret_status = SFU_SUCCESS;

  /* Check WRP ****************************************************************/
  if ((psFlashOptionBytes->WRPStartOffset > SFU_PROTECT_WRP_PAGE_START_1) ||
      (psFlashOptionBytes->WRPEndOffset   < SFU_PROTECT_WRP_PAGE_END_1))
  {
    e_ret_status = SFU_ERROR; /*Protection not applied */
  }
  if (e_ret_status == SFU_SUCCESS)
  {
    /* Execution stopped if flow control failed */
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_WRP, FLOW_CTRL_WRP);
  }
  return e_ret_status;
}

/**
  * @brief  Apply the WRP protection to the specified Area. It includes the SFU Vector Table
  * @param  psFlashOptionBytes: pointer to the Option Bytes structure
  * @param  pbIsProtectionToBeApplied: Output parameter to be set as "TRUE" if
  *         this OptByte has to be modified and immediately reloaded.
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_SetProtectionWRP(FLASH_OBProgramInitTypeDef *psFlashOptionBytes,
                                             SFU_BoolTypeDef *pbIsProtectionToBeApplied)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;

  /* Check/Apply WRP **********************************************************/
  if (SFU_LL_SECU_CheckProtectionWRP(psFlashOptionBytes) == SFU_SUCCESS)
  {
    e_ret_status = SFU_SUCCESS; /*Protection already applied */
  }
  else
  {
#if defined(SECBOOT_OB_DEV_MODE)
    psFlashOptionBytes->OptionType     = OPTIONBYTE_WRP;
    psFlashOptionBytes->WRPArea        = SFU_PROTECT_WRP_AREA_1;
    psFlashOptionBytes->WRPStartOffset = SFU_PROTECT_WRP_PAGE_START_1;
    psFlashOptionBytes->WRPEndOffset   = SFU_PROTECT_WRP_PAGE_END_1;

    if (HAL_FLASHEx_OBProgram(psFlashOptionBytes) == HAL_OK)
    {
      *pbIsProtectionToBeApplied |= 1U;
      e_ret_status = SFU_SUCCESS;
      /* Execution stopped if flow control failed */
      FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_WRP, FLOW_CTRL_WRP);
    }
#else
    TRACE("\r\n= [SBOOT] System Security Configuration failed: WRP is incorrect. STOP!");
    /* Security issue : execution stopped ! */
    SFU_EXCPT_Security_Error();
#endif /* SECBOOT_OB_DEV_MODE */
  }

  return e_ret_status;
}
#endif /*SFU_WRP_PROTECT_ENABLE*/

#ifdef SFU_MPU_PROTECT_ENABLE
/**
  * @brief  Apply MPU protection before executing UserApp
  * @param  None
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_SetProtectionMPU_UserApp(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct;

  /* configure a new area for the currently executing code (SBSFU + active slots) */
  MPU_InitStruct.Enable               = MPU_REGION_ENABLE;
  MPU_InitStruct.Number               = APP_PROTECT_MPU_FLASHEXE_2_RGNV;
  MPU_InitStruct.BaseAddress          = APP_PROTECT_MPU_FLASHEXE_2_START;
  MPU_InitStruct.Size                 = APP_PROTECT_MPU_FLASHEXE_2_SIZE;
  MPU_InitStruct.SubRegionDisable     = APP_PROTECT_MPU_FLASHEXE_2_SREG;
  MPU_InitStruct.AccessPermission     = APP_PROTECT_MPU_FLASHEXE_2_PERM;
  MPU_InitStruct.DisableExec          = APP_PROTECT_MPU_FLASHEXE_2_EXECV;
  MPU_InitStruct.IsShareable          = MPU_ACCESS_NOT_SHAREABLE;
  MPU_InitStruct.IsBufferable         = APP_PROTECT_MPU_FLASHEXE_2_B ;
  MPU_InitStruct.IsCacheable          = APP_PROTECT_MPU_FLASHEXE_2_C;
  MPU_InitStruct.TypeExtField         = APP_PROTECT_MPU_FLASHEXE_2_TEXV;
  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /* remap the current area (SBSFU + active slots) */
  MPU_InitStruct.Enable               = MPU_REGION_ENABLE;
  MPU_InitStruct.Number               = APP_PROTECT_MPU_FLASHEXE_1_RGNV;
  MPU_InitStruct.BaseAddress          = APP_PROTECT_MPU_FLASHEXE_1_START;
  MPU_InitStruct.Size                 = APP_PROTECT_MPU_FLASHEXE_1_SIZE;
  MPU_InitStruct.SubRegionDisable     = APP_PROTECT_MPU_FLASHEXE_1_SREG;
  MPU_InitStruct.AccessPermission     = APP_PROTECT_MPU_FLASHEXE_1_PERM;
  MPU_InitStruct.DisableExec          = APP_PROTECT_MPU_FLASHEXE_1_EXECV;
  MPU_InitStruct.IsShareable          = MPU_ACCESS_NOT_SHAREABLE;
  MPU_InitStruct.IsBufferable         = APP_PROTECT_MPU_FLASHEXE_1_B ;
  MPU_InitStruct.IsCacheable          = APP_PROTECT_MPU_FLASHEXE_1_C;
  MPU_InitStruct.TypeExtField         = APP_PROTECT_MPU_FLASHEXE_1_TEXV;
  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /*  Remove the write rights for the SRAM synchronization flag */
  MPU_InitStruct.Enable               = MPU_REGION_ENABLE;
  MPU_InitStruct.Number               = APP_PROTECT_MPU_SRAM_FLAG_RGNV;
  MPU_InitStruct.BaseAddress          = APP_PROTECT_MPU_SRAM_FLAG_START;
  MPU_InitStruct.Size                 = APP_PROTECT_MPU_SRAM_FLAG_SIZE;
  MPU_InitStruct.SubRegionDisable     = APP_PROTECT_MPU_SRAM_FLAG_SREG;
  MPU_InitStruct.AccessPermission     = APP_PROTECT_MPU_SRAM_FLAG_PERM;
  MPU_InitStruct.DisableExec          = APP_PROTECT_MPU_SRAM_FLAG_EXECV;
  MPU_InitStruct.IsShareable          = MPU_ACCESS_NOT_SHAREABLE;
  MPU_InitStruct.IsBufferable         = APP_PROTECT_MPU_SRAM_FLAG_B ;
  MPU_InitStruct.IsCacheable          = APP_PROTECT_MPU_SRAM_FLAG_C;
  MPU_InitStruct.TypeExtField         = APP_PROTECT_MPU_SRAM_FLAG_TEXV;
  HAL_MPU_ConfigRegion(&MPU_InitStruct);


  return SFU_SUCCESS;
}
#endif /* SFU_MPU_PROTECT_ENABLE */


#ifdef SFU_MPU_PROTECT_ENABLE

/**
  * @brief  Apply MPU protection
  * @param  None
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_SetProtectionMPU(void)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;
  uint8_t mpu_region_num; /* id of the MPU region being configured */
  MPU_Region_InitTypeDef MPU_InitStruct;

  HAL_MPU_Disable();

  for (mpu_region_num = 0U; mpu_region_num < (sizeof(MpuAreas) / sizeof(SFU_MPU_InitTypeDef)); mpu_region_num++)
  {
    MPU_InitStruct.Enable               = MPU_REGION_ENABLE;
    MPU_InitStruct.Number               = MpuAreas[mpu_region_num].Number;
    MPU_InitStruct.BaseAddress          = MpuAreas[mpu_region_num].BaseAddress;
    MPU_InitStruct.Size                 = MpuAreas[mpu_region_num].Size;
    MPU_InitStruct.SubRegionDisable     = MpuAreas[mpu_region_num].SubRegionDisable;
    MPU_InitStruct.AccessPermission     = MpuAreas[mpu_region_num].AccessPermission;
    MPU_InitStruct.DisableExec          = MpuAreas[mpu_region_num].DisableExec;
    MPU_InitStruct.IsShareable          = MPU_ACCESS_NOT_SHAREABLE;
    MPU_InitStruct.IsBufferable         = MpuAreas[mpu_region_num].Bufferable;
    MPU_InitStruct.IsCacheable          = MpuAreas[mpu_region_num].Cacheable;
    MPU_InitStruct.TypeExtField         = MpuAreas[mpu_region_num].Tex;
#if defined(SFU_VERBOSE_DEBUG_MODE)
    TRACE(" @%d:%x size:%x sub:%x perm:%x exec:%x\r\n",
          MPU_InitStruct.Number, MPU_InitStruct.BaseAddress, MPU_InitStruct.Size, MPU_InitStruct.SubRegionDisable,
          MPU_InitStruct.AccessPermission, MPU_InitStruct.DisableExec);
#endif /* SFU_VERBOSE_DEBUG_MODE */
    HAL_MPU_ConfigRegion(&MPU_InitStruct);
  }
  HAL_MPU_Enable(MPU_HARDFAULT_NMI);
  e_ret_status = SFU_SUCCESS;


  if (e_ret_status == SFU_SUCCESS)
  {
    /* Execution stopped if flow control failed */
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_MPU, FLOW_CTRL_MPU);
  }
  return e_ret_status;
}
#endif /*SFU_MPU_PROTECT_ENABLE*/

