STMicroelectronics/STM32CubeWL/Projects/NUCLEO-WL55JC/Applications/SBSFU_2_Images_DualCore/2_Images_SBSFU/CM0PLUS/SBSFU/Target/sfu_low_level_security.c
#ifdef SFU_GTZC_PROTECT_ENABLE
/**
  * @brief  Apply GTZC protection: FLASH, RAM, PKA, RNG, AES.
  * @param  None
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_SetProtectionGTZC(void)
{
  SFU_ErrorStatus e_ret_status = SFU_SUCCESS;
  MPCWM_ConfigTypeDef mpcwm_desc;

  /* Handle the GTZC TZC lock *************************************************/

  /* Configure FLASH memory ***************************************************/
  mpcwm_desc.AreaId = GTZC_TZSC_MPCWM_AREAID_UNPRIV;
  mpcwm_desc.Length = SFU_PROTECT_GTZC_EXEC_SE_START - FLASH_BASE;
  if (HAL_GTZC_TZSC_MPCWM_ConfigMemAttributes(FLASH_BASE, &mpcwm_desc) != HAL_OK)
  {
    e_ret_status = SFU_ERROR;
  }
  mpcwm_desc.AreaId = GTZC_TZSC_MPCWM_AREAID_UNPRIV_WRITABLE;
  if (HAL_GTZC_TZSC_MPCWM_ConfigMemAttributes(FLASH_BASE, &mpcwm_desc) != HAL_OK)
  {
    e_ret_status = SFU_ERROR;
  }

  /* Configure SRAM1 memory ***************************************************/
  mpcwm_desc.AreaId = GTZC_TZSC_MPCWM_AREAID_UNPRIV;
  mpcwm_desc.Length = SRAM1_SIZE;
  if (HAL_GTZC_TZSC_MPCWM_ConfigMemAttributes(SRAM1_BASE, &mpcwm_desc) != HAL_OK)
  {
    e_ret_status = SFU_ERROR;
  }

  /* Configure SRAM2 memory ***************************************************/
  mpcwm_desc.AreaId = GTZC_TZSC_MPCWM_AREAID_UNPRIV;
  mpcwm_desc.Length = SE_REGION_RAM_START - SRAM2_BASE;
  if (HAL_GTZC_TZSC_MPCWM_ConfigMemAttributes(SRAM2_BASE, &mpcwm_desc) != HAL_OK)
  {
    e_ret_status = SFU_ERROR;
  }

  /* Configure TZSC peripherals ***********************************************/
  if (HAL_GTZC_TZSC_ConfigPeriphAttributes(GTZC_PERIPH_AES,
                                           (GTZC_TZSC_ATTRIBUTE_SEC  | GTZC_TZSC_ATTRIBUTE_PRIV)) != HAL_OK)
  {
    e_ret_status = SFU_ERROR;
  }
  if (HAL_GTZC_TZSC_ConfigPeriphAttributes(GTZC_PERIPH_RNG,
                                           (GTZC_TZSC_ATTRIBUTE_SEC  | GTZC_TZSC_ATTRIBUTE_PRIV)) != HAL_OK)
  {
    e_ret_status = SFU_ERROR;
  }

  if (HAL_GTZC_TZSC_ConfigPeriphAttributes(GTZC_PERIPH_SUBGHZSPI,
                                           (GTZC_TZSC_ATTRIBUTE_NPRIV)) != HAL_OK)
  {
    e_ret_status = SFU_ERROR;
  }

  if (HAL_GTZC_TZSC_ConfigPeriphAttributes(GTZC_PERIPH_PKA,
                                           (GTZC_TZSC_ATTRIBUTE_SEC  | GTZC_TZSC_ATTRIBUTE_PRIV)) != HAL_OK)
  {
    e_ret_status = SFU_ERROR;
  }

  /* Configure TZIC peripherals ***********************************************/

  /* Configure FLASH_ACR2 */
  MODIFY_REG(FLASH->ACR2, FLASH_ACR2_PRIVMODE, FLASH_ACR2_PRIVMODE);

  /* Enable the IT for the concerned peripherals */
  if (HAL_GTZC_TZIC_EnableIT(GTZC_PERIPH_TZIC) != HAL_OK)
  {
    e_ret_status = SFU_ERROR;
  }
  if (HAL_GTZC_TZIC_EnableIT(GTZC_PERIPH_TZSC) != HAL_OK)
  {
    e_ret_status = SFU_ERROR;
  }
  if (HAL_GTZC_TZIC_EnableIT(GTZC_PERIPH_AES) != HAL_OK)
  {
    e_ret_status = SFU_ERROR;
  }
  if (HAL_GTZC_TZIC_EnableIT(GTZC_PERIPH_RNG) != HAL_OK)
  {
    e_ret_status = SFU_ERROR;
  }
  if (HAL_GTZC_TZIC_EnableIT(GTZC_PERIPH_SUBGHZSPI) != HAL_OK)
  {
    e_ret_status = SFU_ERROR;
  }
  if (HAL_GTZC_TZIC_EnableIT(GTZC_PERIPH_PWR) != HAL_OK)
  {
    e_ret_status = SFU_ERROR;
  }
  if (HAL_GTZC_TZIC_EnableIT(GTZC_PERIPH_FLASHIF) != HAL_OK)
  {
    e_ret_status = SFU_ERROR;
  }
  if (HAL_GTZC_TZIC_EnableIT(GTZC_PERIPH_DMA1) != HAL_OK)
  {
    e_ret_status = SFU_ERROR;
  }
  if (HAL_GTZC_TZIC_EnableIT(GTZC_PERIPH_DMA2) != HAL_OK)
  {
    e_ret_status = SFU_ERROR;
  }
  if (HAL_GTZC_TZIC_EnableIT(GTZC_PERIPH_DMAMUX) != HAL_OK)
  {
    e_ret_status = SFU_ERROR;
  }
  if (HAL_GTZC_TZIC_EnableIT(GTZC_PERIPH_FLASH) != HAL_OK)
  {
    e_ret_status = SFU_ERROR;
  }
  if (HAL_GTZC_TZIC_EnableIT(GTZC_PERIPH_SRAM1) != HAL_OK)
  {
    e_ret_status = SFU_ERROR;
  }
  if (HAL_GTZC_TZIC_EnableIT(GTZC_PERIPH_SRAM2) != HAL_OK)
  {
    e_ret_status = SFU_ERROR;
  }
  if (HAL_GTZC_TZIC_EnableIT(GTZC_PERIPH_PKA) != HAL_OK)
  {
    e_ret_status = SFU_ERROR;
  }

  /* Enable IRQ */
  NVIC_EnableIRQ(TZIC_ILA_IRQn);

  /* Handle the GTZC TZC lock *************************************************/
  HAL_GTZC_TZSC_Lock(GTZC_TZSC);


  if (e_ret_status == SFU_SUCCESS)
  {
    /* Execution stopped if flow control failed */
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_GTZC, FLOW_CTRL_GTZC);
  }

  return e_ret_status;
}
#endif /* SFU_GTZC_PROTECT_ENABLE */



#ifdef SFU_DMA_PROTECT_ENABLE
/**
  * @brief  Apply DMA protection
  * @param  None
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_SetProtectionDMA(void)
{
  /*
   * In this function we disable the DMA buses in order to avoid that while the SB/SFU is running
   * some DMA has been already enabled (e.g. through debugger in RDP-1 after reset) in order to access sensitive
   * information in SRAM, FLASH
   */
  /* Disable  DMA1, DMA2 */
  __HAL_RCC_DMA1_CLK_DISABLE();

  __HAL_RCC_DMA2_CLK_DISABLE();

  __HAL_RCC_DMAMUX1_CLK_DISABLE();




  /* Execution stopped if flow control failed */
  FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_DMA, FLOW_CTRL_DMA);
  return SFU_SUCCESS;
}
#endif /*SFU_DMA_PROTECT_ENABLE*/

#ifdef SFU_IWDG_PROTECT_ENABLE
/**
  *  @brief Apply IWDG protection
  *         The IWDG timeout is set to 4 second.
  *         Then, the IWDG reload counter is configured as below to obtain 4 second according
  *         to the measured LSI frequency after setting the prescaler value:
  *         IWDG counter clock Frequency = LSI Frequency / Prescaler value
  * @param  None
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_SetProtectionIWDG(void)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;

  /* TIMER could be used to get the LSI frequency in order to have a more precise IWDG.
  This is not used in this implementation because not necessary and in order
  to optimize code-size. If you are interested, please have a look at the IWDG Cube example. */

  /* Configure & Start the IWDG peripheral */
  /* Set counter reload value to obtain 6 sec. IWDG TimeOut.
  IWDG counter clock Frequency = uwLsiFreq
  Set Prescaler to 64 (IWDG_PRESCALER_64)
  Timeout Period = (Reload Counter Value * 64) / uwLsiFreq
  So Set Reload Counter Value = (6 * uwLsiFreq) / 64 */
  IwdgHandle.Instance = IWDG;
  IwdgHandle.Init.Prescaler = IWDG_PRESCALER_64;
  IwdgHandle.Init.Reload = (SFU_IWDG_TIMEOUT * LSI_VALUE / 64U);
  IwdgHandle.Init.Window = IWDG_WINDOW_DISABLE;

