STMicroelectronics/STM32CubeWL/Projects/NUCLEO-WL55JC/Applications/SBSFU_2_Images_DualCore/2_Images_SBSFU/CM0PLUS/SBSFU/Target/sfu_low_level_security.c
  /* Test if Secure Memory size is correctly programmed and unique boot entry activated.
   */
  if (psFlashOptionBytes->SecureMode == SFU_SECURE_MODE)
  {
    /*
     * In this example secure area covers:
     * - the SB_SFU code
     * - the header of the active slots
     */
#if defined(SFU_VERBOSE_DEBUG_MODE)
    TRACE("\r\n= [SBOOT] Secure Mode: [%x]", psFlashOptionBytes->SecureMode);
#endif /* SFU_VERBOSE_DEBUG_MODE */
    e_ret_status = SFU_SUCCESS;

    if ((psFlashOptionBytes->SecureMode & OB_SECURE_SYSTEM_AND_FLASH_ENABLE) == OB_SECURE_SYSTEM_AND_FLASH_ENABLE)
    {
      if (psFlashOptionBytes->SecureFlashStartAddr == SFU_SECURE_FLASH_START)
      {
#if defined(SFU_VERBOSE_DEBUG_MODE)
        TRACE("\r\n= [SBOOT] Secure Flash Start Address: [%x]", psFlashOptionBytes->SecureFlashStartAddr);
#endif /* SFU_VERBOSE_DEBUG_MODE */
      }
      else
      {
        e_ret_status = SFU_ERROR;
      }
    }

    if ((e_ret_status == SFU_SUCCESS)
        && ((psFlashOptionBytes->SecureMode & OB_SECURE_HIDE_PROTECTION_ENABLE) == OB_SECURE_HIDE_PROTECTION_ENABLE))
    {
      if (psFlashOptionBytes->HideProtectionStartAddr == SFU_HIDE_PROTECTION_START)
      {
#if defined(SFU_VERBOSE_DEBUG_MODE)
        TRACE("\r\n= [SBOOT] Hide Protection Start Address: [%x]", psFlashOptionBytes->HideProtectionStartAddr);
#endif /* SFU_VERBOSE_DEBUG_MODE */
      }
      else
      {
        e_ret_status = SFU_ERROR;
      }
    }

    if ((e_ret_status == SFU_SUCCESS)
        && ((psFlashOptionBytes->SecureMode & OB_SECURE_SRAM1_ENABLE) == OB_SECURE_SRAM1_ENABLE))
    {
      if (psFlashOptionBytes->SecureSRAM1StartAddr == SFU_SECURE_SRAM1_START)
      {
#if defined(SFU_VERBOSE_DEBUG_MODE)
        TRACE("\r\n= [SBOOT] Secure SRAM1 Start Address: [%x]", psFlashOptionBytes->SecureSRAM1StartAddr);
#endif /* SFU_VERBOSE_DEBUG_MODE */
      }
      else
      {
        e_ret_status = SFU_ERROR;
      }
    }

    if ((e_ret_status == SFU_SUCCESS)
        && ((psFlashOptionBytes->SecureMode & OB_SECURE_SRAM2_ENABLE) == OB_SECURE_SRAM2_ENABLE))
    {
      if (psFlashOptionBytes->SecureSRAM2StartAddr == SFU_SECURE_SRAM2_START)
      {
#if defined(SFU_VERBOSE_DEBUG_MODE)
        TRACE("\r\n= [SBOOT] Secure SRAM2 Start Address: [%x]", psFlashOptionBytes->SecureSRAM2StartAddr);
#endif /* SFU_VERBOSE_DEBUG_MODE */
      }
      else
      {
        e_ret_status = SFU_ERROR;
      }
    }
  }

  /* Execution stopped if flow control failed */
  if (e_ret_status == SFU_SUCCESS)
  {
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_SEC_MEM, FLOW_CTRL_SEC_MEM);
  }
  return e_ret_status;
}


/**
  * @brief  Apply Secure User Memory protection.
  * @param  psFlashOptionBytes: pointer to the Option Bytes structure.
  * @param  pbIsProtectionToBeApplied: Output parameter to be set as "TRUE" if
  *         this OptByte has to be modified and immediately reloaded.
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_SetProtectionSecUser(FLASH_OBProgramInitTypeDef *psFlashOptionBytes,
                                                 SFU_BoolTypeDef *pbIsProtectionToBeApplied)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;

  /* Check if Secure User Memory is already configured */
  if (SFU_LL_SECU_CheckProtectionSecUser(psFlashOptionBytes) == SFU_SUCCESS)
  {
    e_ret_status = SFU_SUCCESS;
  }
  else
  {
    /* Apply the proper configuration if we are in development mode */
#if defined(SECBOOT_OB_DEV_MODE)
    /* Set the security bit if needed */
    /* ------------------------------ */
    psFlashOptionBytes->OptionType = OPTIONBYTE_SECURE_MODE;

    psFlashOptionBytes->SecureFlashStartAddr    = SFU_SECURE_FLASH_START;
    psFlashOptionBytes->SecureSRAM2StartAddr    = SFU_SECURE_SRAM2_START;
    /* psFlashOptionBytes->SecureSRAM1StartAddr    = SFU_SECURE_SRAM1_START; */
    psFlashOptionBytes->HideProtectionStartAddr = SFU_HIDE_PROTECTION_START;
    psFlashOptionBytes->SecureMode              = SFU_SECURE_MODE;

    if (HAL_FLASHEx_OBProgram(psFlashOptionBytes) == HAL_OK)
    {
      *pbIsProtectionToBeApplied |= 1U;
      e_ret_status = SFU_SUCCESS;
      /* Execution stopped if flow control failed */
      FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_SEC_MEM, FLOW_CTRL_SEC_MEM);
    }
#else
    TRACE("\r\n= [SBOOT] System Security Configuration failed: Secure User Memory is incorrect. STOP!");
    /* Security issue : execution stopped ! */
    SFU_EXCPT_Security_Error();
#endif /* SECBOOT_OB_DEV_MODE */
  }

  return e_ret_status;
}

#endif /* SFU_SECURE_USER_PROTECT_ENABLE */

/**
  * @brief  Activate Secure User Memory protection and jump into user application.
  * @param  Address of the code to jump into
  * @retval none.
  */


#ifdef SFU_GTZC_PROTECT_ENABLE
/**
  * @brief  Check Sub-GHz radio SPI protection configuration.
  * @param  psFlashOptionBytes: pointer to the Option Bytes structure.
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
SFU_ErrorStatus SFU_LL_SECU_CheckProtectionSUBGHZSPI(FLASH_OBProgramInitTypeDef *psFlashOptionBytes)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;

  /* Check/Apply Sub-GHz radio SPI ********************************************/
  /* Check if the protection is already applied */
  if (psFlashOptionBytes->SUBGHZSPISecureAccess == OB_SUBGHZSPI_SECURE_ACCESS_ENABLE)
  {
    e_ret_status = SFU_SUCCESS;
  }

  if (e_ret_status == SFU_SUCCESS)
  {
    /* Execution stopped if flow control failed */
    FLOW_CONTROL_STEP(uFlowProtectValue, FLOW_STEP_SUBGHZSPI, FLOW_CTRL_SUBGHZSPI);
  }
  return e_ret_status;
}

/**
  * @brief  Apply Sub-GHz radio SPI protection.
  * @param  psFlashOptionBytes: pointer to the Option Bytes structure.
  * @param  pbIsProtectionToBeApplied: Output parameter to be set as "TRUE" if
  *         this OptByte has to be modified and immediately reloaded.
  * @retval If Protection is not set, RSS procedure is called with a System Reset
  */
SFU_ErrorStatus SFU_LL_SECU_SetProtectionSUBGHZSPI(FLASH_OBProgramInitTypeDef *psFlashOptionBytes,
                                                   SFU_BoolTypeDef *pbIsProtectionToBeApplied)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;

  /* Check if the protection is already applied */
  if (SFU_LL_SECU_CheckProtectionSUBGHZSPI(psFlashOptionBytes) == SFU_SUCCESS)
  {
    e_ret_status = SFU_SUCCESS;
  }
  else
  {
    /* Apply the proper configuration if we are in development mode */
#if defined(SECBOOT_OB_DEV_MODE)
    /* Set the security bit if needed */
    /* ------------------------------ */
    psFlashOptionBytes->OptionType = OPTIONBYTE_SUBGHZSPI_SECURE_ACCESS;

